TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_mcanss.h
//###########################################################################
//
// FILE:    hw_mcanss.h
//
// TITLE:   Register-level header file for MCANSS
//
//###########################################################################
// //
//	Copyright: Copyright (C) Texas Instruments Incorporated
//	All rights reserved not granted herein.
//
//  Redistribution and use in source and binary forms, with or without 
//  modification, are permitted provided that the following conditions 
//  are met:
//
//  Redistributions of source code must retain the above copyright 
//  notice, this list of conditions and the following disclaimer.
//
//  Redistributions in binary form must reproduce the above copyright
//  notice, this list of conditions and the following disclaimer in the 
//  documentation and/or other materials provided with the   
//  distribution.
//
//  Neither the name of Texas Instruments Incorporated nor the names of
//  its contributors may be used to endorse or promote products derived
//  from this software without specific prior written permission.
//
//  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
//  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
//  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
//  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
//  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
//  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
//  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
//  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
//  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
//  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
//  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//

//###########################################################################

#ifndef HW_MCANSS_H_
#define HW_MCANSS_H_

#ifdef __cplusplus
extern "C"
{
#endif

//
//  Includes
//
#include "hw_memmap.h"

/****************************************************************************************************
* Register Definitions
****************************************************************************************************/
// Sub-module base addresses
#define MCAN_MCAN_MSG_MEM                            (0x0U)
#define MCANSS_REGS                                  (MCANASS_BASE - MCANA_DRIVER_BASE)
#define MCAN_REGS                                    (MCANA_BASE - MCANA_DRIVER_BASE)
#define MCAN_ERROR_REGS                              (MCANA_ERROR_BASE - MCANA_DRIVER_BASE)

#define MCAN_MCANSS_PID                              (MCANSS_REGS + 0x0U)
#define MCAN_MCANSS_CTRL                             (MCANSS_REGS + 0x4U)
#define MCAN_MCANSS_STAT                             (MCANSS_REGS + 0x8U)
#define MCAN_MCANSS_ICS                              (MCANSS_REGS + 0xcU)
#define MCAN_MCANSS_IRS                              (MCANSS_REGS + 0x10U)
#define MCAN_MCANSS_IECS                             (MCANSS_REGS + 0x14U)
#define MCAN_MCANSS_IE                               (MCANSS_REGS + 0x18U)
#define MCAN_MCANSS_IES                              (MCANSS_REGS + 0x1cU)
#define MCAN_MCANSS_EOI                              (MCANSS_REGS + 0x20U)
#define MCAN_MCANSS_EXT_TS_PRESCALER                 (MCANSS_REGS + 0x24U)
#define MCAN_MCANSS_EXT_TS_UNSERVICED_INTR_CNTR      (MCANSS_REGS + 0x28U)

#define MCAN_CREL                                    (MCAN_REGS + 0x00U)
#define MCAN_ENDN                                    (MCAN_REGS + 0x04U)
#define MCAN_CUST                                    (MCAN_REGS + 0x08U)
#define MCAN_DBTP                                    (MCAN_REGS + 0x0cU)
#define MCAN_TEST                                    (MCAN_REGS + 0x10U)
#define MCAN_RWD                                     (MCAN_REGS + 0x14U)
#define MCAN_CCCR                                    (MCAN_REGS + 0x18U)
#define MCAN_NBTP                                    (MCAN_REGS + 0x1cU)
#define MCAN_TSCC                                    (MCAN_REGS + 0x20U)
#define MCAN_TSCV                                    (MCAN_REGS + 0x24U)
#define MCAN_TOCC                                    (MCAN_REGS + 0x28U)
#define MCAN_TOCV                                    (MCAN_REGS + 0x2cU)
#define MCAN_ECR                                     (MCAN_REGS + 0x40U)
#define MCAN_PSR                                     (MCAN_REGS + 0x44U)
#define MCAN_TDCR                                    (MCAN_REGS + 0x48U)
#define MCAN_IR                                      (MCAN_REGS + 0x50U)
#define MCAN_IE                                      (MCAN_REGS + 0x54U)
#define MCAN_ILS                                     (MCAN_REGS + 0x58U)
#define MCAN_ILE                                     (MCAN_REGS + 0x5cU)
#define MCAN_GFC                                     (MCAN_REGS + 0x80U)
#define MCAN_SIDFC                                   (MCAN_REGS + 0x84U)
#define MCAN_XIDFC                                   (MCAN_REGS + 0x88U)
#define MCAN_XIDAM                                   (MCAN_REGS + 0x90U)
#define MCAN_HPMS                                    (MCAN_REGS + 0x94U)
#define MCAN_NDAT1                                   (MCAN_REGS + 0x98U)
#define MCAN_NDAT2                                   (MCAN_REGS + 0x9cU)
#define MCAN_RXF0C                                   (MCAN_REGS + 0xa0U)
#define MCAN_RXF0S                                   (MCAN_REGS + 0xa4U)
#define MCAN_RXF0A                                   (MCAN_REGS + 0xa8U)
#define MCAN_RXBC                                    (MCAN_REGS + 0xacU)
#define MCAN_RXF1C                                   (MCAN_REGS + 0xb0U)
#define MCAN_RXF1S                                   (MCAN_REGS + 0xb4U)
#define MCAN_RXF1A                                   (MCAN_REGS + 0xb8U)
#define MCAN_RXESC                                   (MCAN_REGS + 0xbcU)
#define MCAN_TXBC                                    (MCAN_REGS + 0xc0U)
#define MCAN_TXFQS                                   (MCAN_REGS + 0xc4U)
#define MCAN_TXESC                                   (MCAN_REGS + 0xc8U)
#define MCAN_TXBRP                                   (MCAN_REGS + 0xccU)
#define MCAN_TXBAR                                   (MCAN_REGS + 0xd0U)
#define MCAN_TXBCR                                   (MCAN_REGS + 0xd4U)
#define MCAN_TXBTO                                   (MCAN_REGS + 0xd8U)
#define MCAN_TXBCF                                   (MCAN_REGS + 0xdcU)
#define MCAN_TXBTIE                                  (MCAN_REGS + 0xe0U)
#define MCAN_TXBCIE                                  (MCAN_REGS + 0xe4U)
#define MCAN_TXEFC                                   (MCAN_REGS + 0xf0U)
#define MCAN_TXEFS                                   (MCAN_REGS + 0xf4U)
#define MCAN_TXEFA                                   (MCAN_REGS + 0xf8U)

